## 1. 반도체를 이용한 데이터 저장 소자(반도체)
   - 비휘발성
## 2. EEPROM에서 발전한 메모리 형태 구조를 갖는다
   - EEPROM(Electrically Erasable Programmable Read-Only Memory)
   - 전기적으로 데이터를 읽고 쓸 수 있는 반도체
## 3. 장/단점
   - 장점
     1) 비휘발성(데이터가 전기적 신호를 주기 전까지 없어지지 않음)
     2) 자기 매체나 광학 매체에 비해 기계적인 충격에 강하고, 직사광선, 고온, 습기에도 강하다.
   - 단점
     1) 제한된 쓰기/지우기 수명
         - 플래시 메모리는 셀마다 한정된 수의 쓰기/지우기 작업을 수행할 수 있는 횟수에 제한이 있어, 
           이를 초과하면 플래시 메모리의 수명이 감소 
     2) 블록 단위 지우기
         - 플래시 메모리는 전체 블록을 한 번에 지워야 하므로, 개별의 데이터의 지우기 작업을 못한다.
